{"posts":[{"title":"认证红队操作员 (CRTO) 回顾","text":"概述我最近有机会参加了ZeroPoint Security Red Team Ops课程和考试。课程由Daniel Duggan（又名Rastamouse）完成并教授，以下是我对课程和考试的评论。 我的背景我的IT背景是，我是一个新手。大一学生，我开始从事攻击性网络安全还不到1年，关于我目前拥有的其他认证是CRTP（红队专家），这里。 课程正如你在这个认证的名称中所看到的，该课程将只围绕网络团队的主题，关于课程材料，我想说ZeroPoint Security提供的材料具有的质量。 你将有机会驾驶C2，Cobalt Strike 。如果你决定购买399磅（约473欧元）的包，这个课程包括40小时的实验室，起初我以为40小时的实验室会非常少，但最后我可以用20小时完成课程的实验室，其余的实验室时间我用来测试方法，因为课程中你要学习的地方非常广泛。 Command &amp; Control External Recon Initial Compromise Host Recon Host Persistence Host Privilege Escalation Elevate Host Persistence Credentials Dumping Domain Recon User Impersonation Lateral Movement Session Passing Pivoting Data Protection API Kerberos AD CS Group Policy MS SQL Domain Persistence Forest &amp; Domain Trusts Local Administrator Password Solution Microsoft Defender AV Application Whitelisting Data Hunting &amp; Exiltration 正如你所看到的，这是一个非常广泛的课程，匆匆忙忙地完成内容对考试来说是有点冒险的。为了避免被概念所淹没，我采用的方法是先看整个课程，并在第一时间做笔记，然后再去看每个模块，做更详细的笔记，对概念进行更深入的研究，最后我带着之前做的笔记投入到实验室中，这花了我大约一个半月的时间。关于课程的意见，我相当喜欢Kerberos模块，它从0开始解释了Kerberos的工作原理，也喜欢Inital Comprise模块，在这个模块中，你可以学习如何通过钓鱼来获得对域名的访问，以及如何绕过Windows Defender。 考试CRTO考试是一个CTF式的考试，你在考试实验室总共有8个旗子要收集，有75%的旗子（6/8）才能通过，有48小时的考试时间，你可以在4天内分摊。有了之前参考CRTP考试的经验，我在考试的时候可以更加放松，考试是模拟一个针对X个目标的APT，有X个域，具体不能在这里面详细解释。 我在2022年12月29日完成了课程，我决定第二天在2022年12月30日参加考试，我知道这很疯狂，因为这意味着要在新的一年里参加考试，但我想把肩上的担子卸下来，我把考试放在第二天上午12点。前一天晚上我在网上看复习，事实可以说我被考试吓到了，在那里有的人无法解除信标或Windows Defender检测到并立即杀死了进程，花了考试的前10个小时或第一天就解决了这些问题，但令人惊讶的是，在我的情况下，我总共花了8个小时的考试，得到了6/8个flag，足以通过今天是我考试的第二天，肯定在写完这个评论后，我会打开考试实验室，试图得到剩余的2个标志。 关于考试的难度，对我来说，事实并不难，因为我以前就知道如何 “攻击 “一个内网，我并不是说这是一个轻松的考试，因为在某些时候，你必须思维，结合攻击方法来破坏域或其他森林中的一台机器。在我看来，认证的总体难度可以是中的认证（可能会随着时间的推移而改变）。 结论如果你正在寻找一个认证，在其中你可以了解到网络团队和C2的处理，我会说这个认证是最好的，非常适合在这个领域起步的人，值得注意的是，ZeroPoint Security最近发布了一个CRTL的延续。 https://medium.com/r3d-buck3t/attacking-kerberos-constrained-delegations-4a0eddc5bb13#f061 https://hausec.com/2021/07/26/cobalt-strike-and-tradecraft/ https://www.redteam101.tech/ https://www.ired.team/offensive-security/red-team-infrastructure/cobalt-strike-101-installation-and-interesting-commands?q=COBALTSTRIKE","link":"/2023/01/03/CRTO-Review/"},{"title":"认证红队专家（CRTP）回顾","text":"大家好，今天我将写下自己对CRTP认证训练营的评论，这个评论将分为以下几个部分。 训练营 内容 考试 个人推荐 结论 未来目标 训练营起初，我并不打算报名参加CRTP训练营，而是购买课程本身，但和朋友商量后，我决定参加训练营，训练营共有4次课程，都是在周日进行，每次课程通常持续至少3个小时，其中将提供课程中的材料，训练营与普通课程的最大区别是，它们是现场课程。我的意思是，你可以问老师，在我的案例中是Nikhil，同时，在训练营中还会有一个Discord服务器，你可以与所有学生互动。关于训练营，我没有什么可补充的。要在这里报名，请点击链接。 内容关于课程的内容，我认为相当完整，因为他们从0开始教你如何用PowerView进行手工列举，但在课程中他们也教你如何使用好的BloodHound工具，这在考试中给我带来了很多问题，我不得不手工列举一切。除此之外，他们还教你本地特权升级，在这里我必须说，课程中涵盖的技术很少，之后你将继续学习横向移动、Persistence、域特权升级和跨信任攻击。除此以外，在训练营中，他们还教你更多的概念，总结起来就是这样。 活动目录枚举 本地特权升级 域特权升级 领域的持久性和支配力 交叉信任攻击 森林的持久性和主导地位 防御措施 - 监测 防御和绕过 - 架构和工作文化变化 防御和绕过 - 欺骗 防御和绕过- PowerShell 回到课程的主题，训练营还包括一个为期1个月的实验室，你可以在以后延长，你可以在这个[链接]（https://www.pentesteracademy.com/activedirectorylab）中看到实验室的结构，除此之外，在训练营中你会得到一个链接，在那里你可以找到所有的材料（工具、手册、pdf、视频）。 考试在课程结束后，最有趣的部分是认证考试，所有在课程中学到的概念都将被测试。 这是一个24小时的考试，你必须提交5个用户，包括本地和企业管理员，以及一份报告的阐述，你有最多48小时来发送。我的考试是在2022年10月6日，在开始考试之前，我在Word中做了一个报告模板，也因为这是我做的第一个认证，如果是你的话，你在考试前甚至在考试中感到紧张也是正常的，我也是这样，但我必须说，紧张并不总是坏事，因为它使你更专注于考试。回到考试，我在早上和中午之间开始考试，我不建议在晚上开始考试，如果你不是很夜行的话，虽然总有一句话说’黑客从不睡觉；）’。我不能对我在考试中丢掉的实验室进行太详细的介绍，但事实是，如果你在课程中做了所有的事情，考试就不会有大问题。 我的意思不是说考试是走马观花，与这里的实践实验室不同，你必须投入第一个用户才能进入下一个用户，这让我在考试中损失最大。我总共花了大约17-18个小时来提交考试的整个AD，在报告中总共花了大约2个小时。 个人推荐对于考试来说，最重要的是控制你的紧张，因为我有一个影响，就是我太专注了，以至于在一开始列举非常简单的东西时，我遗漏了很多东西。另一个建议是休息时间的安排，也就是说，小的休息时间，你可以到阳台或街上去透透气，这一点我没有做到，然后发生的事情就会成为非常有趣的轶事：），为考试制作自己的小抄以及在课程中做笔记也是非常必要的，在我的情况下，我用[Obsidian]（https://obsidian.md/）作为笔记的工具。 结论总之，我认为这是一个相当好的课程和认证，可以从0开始学习AD，如果你打算参加OSCP考试，也可以很好地巩固活动目录的概念，因为现在考试的AD部分是必不可少的。","link":"/2022/11/20/CRTP-Review/"},{"title":"Azure AD 渗透Part 1","text":"前言Hello！！！大家好我们又见面了今天我给你们带来我学到的一些Azure AD知识，近几年很多大公司都开始替换我们普遍的Active Directory替换成了云利于方便。而且在大部分红队operations学会怎么渗透Azure AD已经是一种不可缺的skill，所以我确定了写这篇文章来分享。 什么是Azure AD首先我们得认识什么是Azure AD，这是一个Microsoft’s cloud based identity and access management service 我们可以理解为是一种基于云的标识和访问管理服务。 Azure AD可以用在： 外界资源比如 Azure Portal， Office 365。 内网资源，如场所内的应用程序。 Azure AD可以为我们提供比较安全的远程访问如AD程序, 设备或者内网账户。可能这样听着有点乱以下的图片可以解释： 组成部分在Azure AD我们也有一些术语就像我们常见的Active Directory。虽然名称上面会有不同但作用上都会有一些相似。 Enterprise在这里存放这所有整体Azure AD账户。它是企业拥有并允许访问的独特身份如Tenants，subscriptions，services。 TenantsAzure AD的一个实例，代表一个组织。在普遍的Active Directory和forest也有相似度在内也可以建立一些Trust。。。 Azure AD Directory每个Tenat拥有一个独有的目录，它的用处在于访问一些资源 Subscriptions用于来订阅和付services。在一个目录里可以有多个订阅。 Azure建构Azure内它自有一些独特的建构不像我们往常的Active Directory。 Management Groups Subscriptions Resources Groups Resources Management Groups它用于来管理多个服务订阅，一个management group可以被置于另一个management group的较低层次中但在每个一个MG里都会有个Top-Level Root MG，这个在我们普见的AD我理解为Parent/Child Trusts。 Resources Groups 和 Resources资源是Azure中可部署的项目，如虚拟机、应用服务、存储 账户等，一个resources group我们理解为一个容器用于来存放资源当然这等于比较高的安全性因为每个资源都得归于一个resource group，如果我们删除一个RG等于我们会删除它里内所有存放的资源。 Pass Through Authentication通过认证将密码保留在内部，但也允许用户在Azure和内部有一个单一的密码。例如，当用户在网络上登录Outlook时，他们在网络门户（Azure AD）中输入他们的凭证，然后Azure使用PKI对凭证进行加密，并将其发送给内部的一个代理。代理人对凭证进行解密，并对DC进行验证，DC将状态反馈给代理人，然后再转发到Azure AD。Enumeration解释完这些比较基本的的术语我们可以开始一些比较基本的enumeration来提取信息了。在这篇文章中我将会在用Powershell Scripts. 1ipmo AzureAD.psd1 Users提取所有用户 1Get-AzureADUser All $true 提取特定的用户 1Get-AzureADUser -ObjectId &lt;mail&gt; 寻找一个用户 1Get-AzureADUser -SearchString &quot;admin&quot; 列出一个用户的所有属性 1GetAzure-ADUser -ObjectId &lt;mail&gt;| fl * Groups列出所有的Group 1Get-AzureADGroup -All $true 提取特定的Group 1Get-AzureADGroup -ObjectId &lt;ID&gt; 提取所有组别Dynamic Allow 1Get-AzureADMSGroup |?{$_.GroupTypes -eq 'DynamicMembership'} 提取Group里的用户 1Get-AzureADGroupMember -ObjectId &lt;ID&gt;","link":"/2023/02/07/AttackAzureAD/"}],"tags":[{"name":"内网","slug":"内网","link":"/tags/%E5%86%85%E7%BD%91/"},{"name":"红队","slug":"红队","link":"/tags/%E7%BA%A2%E9%98%9F/"},{"name":"云","slug":"云","link":"/tags/%E4%BA%91/"}],"categories":[{"name":"认证","slug":"认证","link":"/categories/%E8%AE%A4%E8%AF%81/"},{"name":"笔记","slug":"笔记","link":"/categories/%E7%AC%94%E8%AE%B0/"}],"pages":[{"title":"关于我","text":"在读计算机网络安全，内网爱好者 社交账号 Linkedin Twitter","link":"/about/index.html"}]}